xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/include/rtl8192u_regdef.h
#ifndef __RTL8192U_REGDEF_H__
#define __RTL8192U_REGDEF_H__

#include <drv_conf.h>
typedef enum _RF90_RADIO_PATH{
	RF90_PATH_A = 0,			//Radio Path A
	RF90_PATH_B = 1,			//Radio Path B
	RF90_PATH_C = 2,			//Radio Path C
	RF90_PATH_D = 3,			//Radio Path D
	RF90_PATH_MAX				//Max RF number 90 support 
}RF90_RADIO_PATH_E, *PRF90_RADIO_PATH_E;




typedef enum _HW90_BLOCK{
	HW90_BLOCK_MAC = 0,
	HW90_BLOCK_PHY0 = 1,
	HW90_BLOCK_PHY1 = 2,
	HW90_BLOCK_RF = 3,
	HW90_BLOCK_MAXIMUM = 4, // Never use this
}HW90_BLOCK_E, *PHW90_BLOCK_E;

typedef enum _BaseBand_Config_Type{
	BaseBand_Config_PHY_REG = 0,			//Radio Path A
	BaseBand_Config_AGC_TAB = 1,			//Radio Path B
}BaseBand_Config_Type, *PBaseBand_Config_Type;

/*--------------------------Define -------------------------------------------*/
#define	MGN_1M				0x02
#define	MGN_2M				0x04
#define	MGN_5_5M			0x0b
#define	MGN_11M			0x16

#define	MGN_6M				0x0c
#define	MGN_9M				0x12
#define	MGN_12M			0x18
#define	MGN_18M			0x24
#define	MGN_24M			0x30
#define	MGN_36M			0x48
#define	MGN_48M			0x60
#define	MGN_54M			0x6c

#define	MGN_MCS0			0x80
#define	MGN_MCS1			0x81
#define	MGN_MCS2			0x82
#define	MGN_MCS3			0x83
#define	MGN_MCS4			0x84
#define	MGN_MCS5			0x85
#define	MGN_MCS6			0x86
#define	MGN_MCS7			0x87
#define	MGN_MCS8			0x88
#define	MGN_MCS9			0x89
#define	MGN_MCS10			0x8a
#define	MGN_MCS11			0x8b
#define	MGN_MCS12			0x8c
#define	MGN_MCS13			0x8d
#define	MGN_MCS14			0x8e
#define	MGN_MCS15			0x8f

#define DESC90_RATE1M					0x00
#define DESC90_RATE2M					0x01
#define DESC90_RATE5_5M				0x02
#define DESC90_RATE11M					0x03
#define DESC90_RATE6M					0x04
#define DESC90_RATE9M					0x05
#define DESC90_RATE12M					0x06
#define DESC90_RATE18M					0x07
#define DESC90_RATE24M					0x08
#define DESC90_RATE36M					0x09
#define DESC90_RATE48M					0x0a
#define DESC90_RATE54M					0x0b
#define DESC90_RATEMCS0				0x00
#define DESC90_RATEMCS1				0x01
#define DESC90_RATEMCS2				0x02
#define DESC90_RATEMCS3				0x03
#define DESC90_RATEMCS4				0x04
#define DESC90_RATEMCS5				0x05
#define DESC90_RATEMCS6				0x06
#define DESC90_RATEMCS7				0x07
#define DESC90_RATEMCS8				0x08
#define DESC90_RATEMCS9				0x09
#define DESC90_RATEMCS10				0x0a
#define DESC90_RATEMCS11				0x0b
#define DESC90_RATEMCS12				0x0c
#define DESC90_RATEMCS13				0x0d
#define DESC90_RATEMCS14				0x0e
#define DESC90_RATEMCS15				0x0f
#define DESC90_RATEMCS32				0x20


//============================================================================
//       819xUsb Regsiter offset definition
//============================================================================
#define Cmd9346CR_9356SEL	0x00000010

#define bXtalCap01                			0xc0000000
#define bXtalCap23                			0x3

#define	CR9346_CFGRW		0xC0		// Config register write

#define Cmd9346CR			0xFE58	// 9346CR cmd register

// Page 8
#define bRFSI_RFENV			0x10

#define rGlobalCtrl			0x00

#define CR9346				0x0E

#define BSSIDR				0x02E	// BSSID Register

#define CMDR				0x037	// Command register
#define SIFS_CCK			0x03c
#define SIFS_OFDM			0x03e

#define TCR					0x040	// Transmit Configuration Register
#define RCR					0x044	// Receive Configuration Register
#define SLOT 					0x049
#define EIFS					0x04A
#define ACK_TIMEOUT			0x04C	// Ack Timeout Register

#define EDCAPARA_BE		0x050	// EDCA Parameter of AC BE
#define EDCAPARA_BK		0x054	// EDCA Parameter of AC BK
#define EDCAPARA_VO		0x058	// EDCA Parameter of AC VO
#define	EDCAPARA_VI			0x05C	// EDCA Parameter of AC VI

#define BCNTCFG				0x062

#define	BCNITV				0x070	// Beacon Interval (TU)
#define	ATIMWND				0x072	// ATIM Window Size (TU)
#define DRVERLYINT			0x074
#define BCNDMA				0x076	// Beacon DMA register (2 bytes), in unit of us.
#define	BCN_ERR_THRESH		0x078	// Beacon Error Threshold
#define AckTimeOutReg	0x79		// ACK timeout register, in unit of 4 us. 
  
#define	RWCAM				0x0A0	//IN 8190 Data Sheet is called CAMcmd
#define	WCAMI				0x0A4	// Software write CAM input content

#define	SECR				0x0B0	//Security Configuration Register

#define IMR					0xF4	// Interrupt Mask Register
#define ISR					0xF8	// Interrupt Status Register

#define	CPU_GEN				0x100	// CPU Reset Register

#define CPUINST				0x120	//CPU Instruction Register

#define ACMHWCONTROL		0x171	//	ACM Hardware Control Register

#define RQPN1				0x180	// Reserved Queue Page Number , Vo Vi, Be, Bk
#define RQPN2				0x184	// Reserved Queue Page Number, HCCA, Cmd, Mgnt, High
#define RQPN3				0x188	// Reserved Queue Page Number, Bcn, Public, 
#define	USB_RX_AGGR			0x1a8					// Set USB rx aggr control

#define RF_DATA				0x1d4	// FW will write RF data in the register.

#define MAR0				0x240
#define MAR4				0x244
	
#define	BW_OPMODE			0x300	// Bandwidth operation mode
#define	MSR					0x303	// Media Status register
#define	RETRY_LIMIT			0x304	// Retry Limit [15:8]-short, [7:0]-long
#define LBDLY				0x306
#define	RRSR				0x310	// Response Rate Set

#define	UFWP				0x318	// Update Firmware Polling Register
#define	RATR0				0x320	// Rate Adaptive Table register1

//----------------------------------------------------------------------------
//       8190 Response Rate Set Register	(offset 0x310, 4 byte)
//----------------------------------------------------------------------------

#define RRSR_RSC_OFFSET			21
#define RRSR_SHORT_OFFSET			23
#define RRSR_RSC_DUPLICATE			0x600000
#define RRSR_RSC_LOWSUBCHNL		0x400000
#define RRSR_RSC_UPSUBCHANL		0x200000
#define RRSR_SHORT					0x800000
#define RRSR_1M						BIT(0)
#define RRSR_2M						BIT(1) 
#define RRSR_5_5M					BIT(2) 
#define RRSR_11M					BIT(3) 
#define RRSR_6M						BIT(4) 
#define RRSR_9M						BIT(5) 
#define RRSR_12M					BIT(6) 
#define RRSR_18M					BIT(7) 
#define RRSR_24M					BIT(8) 
#define RRSR_36M					BIT(9) 
#define RRSR_48M					BIT(10) 
#define RRSR_54M					BIT(11)
#define RRSR_MCS0					BIT(12)
#define RRSR_MCS1					BIT(13)
#define RRSR_MCS2					BIT(14)
#define RRSR_MCS3					BIT(15)
#define RRSR_MCS4					BIT(16)
#define RRSR_MCS5					BIT(17)
#define RRSR_MCS6					BIT(18)
#define RRSR_MCS7					BIT(19)


