xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/include/rtl8192u_regdef.h
// slot time for 11g
#define SHORT_SLOT_TIME			9
#define NON_SHORT_SLOT_TIME		20


// Bandwidth Offset
#define HAL_PRIME_CHNL_OFFSET_DONT_CARE	0
#define HAL_PRIME_CHNL_OFFSET_LOWER		1
#define HAL_PRIME_CHNL_OFFSET_UPPER		2


//
// Operation mode value
//
#define HT_OPMODE_NO_PROTECT		0
#define HT_OPMODE_OPTIONAL		1
#define HT_OPMODE_40MHZ_PROTECT	2
#define HT_OPMODE_MIXED			3


//
// MIMO Power Save Setings
//
#define MIMO_PS_STATIC				0
#define MIMO_PS_DYNAMIC			1
#define MIMO_PS_NOLIMIT			3

//----------------------------------------------------------------------------
//       8190 (CMD) command register bits		(Offset 0x37, 8 bit)
//----------------------------------------------------------------------------
#define 	CR_RST					0x10
#define 	CR_RE					0x08
#define 	CR_TE					0x04
#define 	CR_MulRW				0x01

//----------------------------------------------------------------------------
//       8190 (RCR) Receive Configuration Register	(Offset 0x44~47, 32 bit)
//----------------------------------------------------------------------------
#define RCR_ONLYERLPKT	BIT(31)				// Early Receiving based on Packet Size.
#define RCR_ENCS2		BIT(30)				// Enable Carrier Sense Detection Method 2
#define RCR_ENCS1		BIT(29)				// Enable Carrier Sense Detection Method 1
#define RCR_ENMBID		BIT(27)				// Enable Multiple BssId.
#define RCR_ACKTXBW		(BIT(24)|BIT(25))	// TXBW Setting of ACK frames
#define RCR_CBSSID		BIT(23)				// Accept BSSID match packet
#define RCR_APWRMGT		BIT(22)				// Accept power management packet
#define	RCR_ADD3		BIT(21)				// Accept address 3 match packet
#define RCR_AMF			BIT(20)				// Accept management type frame
#define RCR_ACF			BIT(19)				// Accept control type frame
#define RCR_ADF			BIT(18)				// Accept data type frame
#define RCR_RXFTH		BIT(13)				// Rx FIFO Threshold
#define RCR_AICV		BIT(12)				// Accept ICV error packet

#define RCR_9356SEL		BIT(6)

#define	RCR_ACRC32		BIT(5)				// Accept CRC32 error packet 
#define	RCR_AB			BIT(3)				// Accept broadcast packet 
#define	RCR_AM			BIT(2)				// Accept multicast packet 
#define	RCR_APM			BIT(1)				// Accept physical match packet
#define	RCR_AAP			BIT(0)				// Accept all unicast packet 

#define RCR_MXDMA_OFFSET	8
#define RCR_FIFO_OFFSET		13
#define RCR_OnlyErlPkt		BIT(31)				// Rx Early mode is performed for packet size greater than 1536

//----------------------------------------------------------------------------
//       8187B EDCAParam bits 					(Offset 0x074-0075, 16bit)
//----------------------------------------------------------------------------
#define AC_PARAM_TXOP_LIMIT_OFFSET		16
#define AC_PARAM_ECW_MAX_OFFSET			12
#define AC_PARAM_ECW_MIN_OFFSET			8
#define AC_PARAM_AIFS_OFFSET			0

//----------------------------------------------------------------------------
//       8190 DrvErlyInt bits					(Offset 0x074-0075, 16bit)
//----------------------------------------------------------------------------

#define	MSR_NOLINK				0x00
#define	MSR_ADHOC				0x01
#define	MSR_INFRA				0x02
#define	MSR_AP					0x03

#define	MSR_ENEDCA


//----------------------------------------------------------------------------
//       8190 CPU General Register		(offset 0x100, 4 byte)
//----------------------------------------------------------------------------

#define 	CPU_CCK_LOOPBACK			0x00030000
#define 	CPU_GEN_SYSTEM_RESET		0x00000001
#define 	CPU_GEN_FIRMWARE_RESET	0x00000008
#define 	CPU_GEN_BOOT_RDY			0x00000010
#define 	CPU_GEN_FIRM_RDY			0x00000020
#define 	CPU_GEN_PUT_CODE_OK		0x00000080
#define 	CPU_GEN_BB_RST			0x00000100
#define 	CPU_GEN_PWR_STB_CPU		0x00000004
#define 	CPU_GEN_NO_LOOPBACK_MSK	0xFFF8FFFF		// Set bit18,17,16 to 0. Set bit19
#define	CPU_GEN_NO_LOOPBACK_SET	0x00080000		// Set BIT19 to 1


#define VOQ_ACM_EN				(0x01 << 7) //BIT7
#define VIQ_ACM_EN				(0x01 << 6) //BIT6
#define BEQ_ACM_EN				(0x01 << 5) //BIT5
#define ACM_HW_EN				(0x01 << 4) //BIT4
#define TXOPSEL					(0x01 << 3) //BIT3
#define VOQ_ACM_CTL				(0x01 << 2) //BIT2 // Set to 1 when AC_VO used time reaches or exceeds the admitted time
#define VIQ_ACM_CTL				(0x01 << 1) //BIT1 // Set to 1 when AC_VI used time reaches or exceeds the admitted time
#define BEQ_ACM_CTL				(0x01 << 0) //BIT0 // Set to 1 when AC_BE used time reaches or exceeds the admitted time

//----------------------------------------------------------------------------
//       8190 AcmHwCtrl bits 					(offset 0x171, 1 byte)
//----------------------------------------------------------------------------
#define	AcmHw_HwEn			BIT(0)
#define	AcmHw_BeqEn			BIT(1)
#define	AcmHw_ViqEn			BIT(2)
#define	AcmHw_VoqEn			BIT(3)
#define	AcmHw_BeqStatus		BIT(4)
#define	AcmHw_ViqStatus		BIT(5)
#define	AcmHw_VoqStatus		BIT(6)

//----------------------------------------------------------------------------
//       8190 BW_OPMODE bits				(Offset 0x300, 8bit)
//----------------------------------------------------------------------------
#define	BW_OPMODE_11J		BIT(0)
#define	BW_OPMODE_5G		BIT(1)
#define	BW_OPMODE_20MHZ	BIT(2)

//----------------------------------------------------------------------------
//       8190 Retry Limit					(Offset 0x304-0305, 16bit)
//----------------------------------------------------------------------------
#define	SRL_SHIFT	8
#define	LRL_SHIFT	0

//----------------------------------------------------------------------------
//       8190 Response Rate Set Register	(offset 0x310, 4 byte)
//----------------------------------------------------------------------------
#define RRSR_1M				BIT(0)
#define RRSR_2M				BIT(1) 
#define RRSR_5_5M			BIT(2) 
#define RRSR_11M				BIT(3) 
#define RRSR_6M				BIT(4) 
#define RRSR_9M				BIT(5) 
#define RRSR_12M				BIT(6) 
#define RRSR_18M				BIT(7) 
#define RRSR_24M				BIT(8) 
#define RRSR_36M				BIT(9) 
#define RRSR_48M				BIT(10)
#define RRSR_54M				BIT(11)




#define rTxAGC_Rate18_06			0xe00
#define rTxAGC_Rate54_24			0xe04
#define rTxAGC_CCK_Mcs32			0xe08
#define rTxAGC_Mcs03_Mcs00			0xe10
#define rTxAGC_Mcs07_Mcs04			0xe14
#define rTxAGC_Mcs11_Mcs08			0xe18
#define rTxAGC_Mcs15_Mcs12			0xe1c

#define bTxAGCRate18_06			0x7f7f7f7f
#define bTxAGCRate54_24			0x7f7f7f7f
#define bTxAGCRateMCS32		0x7f
#define bTxAGCRateCCK			0x7f00
#define bTxAGCRateMCS3_MCS0	0x7f7f7f7f
#define bTxAGCRateMCS7_MCS4	0x7f7f7f7f
#define bTxAGCRateMCS11_MCS8	0x7f7f7f7f
#define bTxAGCRateMCS15_MCS12	0x7f7f7f7f

