xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/include/rtl8192u_regdef.h
#define bZebra1_ChannelNum        0xf80
#define rZebra1_Channel               		0x7

#define bMask12Bits               0xfff
#define bMaskDWord                0xffffffff
#define 	QPNR					0x1d0					// Queue Packet Number report per TID

#define bLSSIReadBackData         		0xfff
#define bLSSIReadAddress          		0x3f000000   //LSSI "Read" Address
#define bLSSIReadEdge             		0x80000000   //LSSI "Read" edge signal
#define BB_GLOBAL_RESET		0x020					// BasebandGlobal Reset Register
//----------------------------------------------------------------------------
//       8190 BB_GLOBAL_RESET	 bits			(Offset 0x020-0027, 8bit)
//----------------------------------------------------------------------------
#define	BB_GLOBAL_RESET_BIT	0x1


//page-8
#define bRFMOD                    			0x1
#define bJapanMode                		0x2
#define bCCKTxSC                  			0x30
#define bCCKEn                    			0x1000000
#define bOFDMEn                   			0x2000000
#define bOFDMRxADCPhase           		0x10000
#define bOFDMTxDACPhase           		0x40000
#define bXATxAGC                  			0x3f
#define bXBTxAGC                  			0xf00
#define bXCTxAGC                  			0xf000
#define bXDTxAGC                  			0xf0000
#define bPAStart                  			0xf0000000
#define bTRStart                  			0x00f00000
#define bRFStart                  			0x0000f000
#define bBBStart                  			0x000000f0
#define bBBCCKStart               		0x0000000f
#define bPAEnd                    			0xf          //Reg0x814
#define bTREnd                    			0x0f000000
#define bRFEnd                    			0x000f0000
#define bCCAMask                  			0x000000f0   //T2R
#define bR2RCCAMask               		0x00000f00
#define bHSSI_R2TDelay            		0xf8000000
#define bHSSI_T2RDelay            		0xf80000
#define bContTxHSSI               		0x400     //chane gain at continue Tx
#define bIGFromCCK                		0x200
#define bAGCAddress               		0x3f
#define bRxHPTx                   			0x7000
#define bRxHPT2R                  			0x38000
#define bRxHPCCKIni               		0xc0000
#define bAGCTxCode                		0xc00000
#define bAGCRxCode                		0x300000
#define b3WireDataLength          		0x800
#define b3WireAddressLength       		0x400
#define b3WireRFPowerDown         		0x1
//#define bHWSISelect               		0x8
#define b5GPAPEPolarity           		0x40000000
#define b2GPAPEPolarity           		0x80000000
#define bRFSW_TxDefaultAnt        		0x3
#define bRFSW_TxOptionAnt         		0x30
#define bRFSW_RxDefaultAnt        		0x300
#define bRFSW_RxOptionAnt         		0x3000
#define bRFSI_3WireData           		0x1
#define bRFSI_3WireClock          		0x2
#define bRFSI_3WireLoad           		0x4
#define bRFSI_3WireRW             		0x8
#define bRFSI_3Wire               			0xf  //3-wire total control
#define bRFSI_RFENV               		0x10
#define bRFSI_TRSW                		0x20
#define bRFSI_TRSWB               		0x40
#define bRFSI_ANTSW               		0x100
#define bRFSI_ANTSWB              		0x200
#define bRFSI_PAPE                			0x400
#define bRFSI_PAPE5G              		0x800 
#define bBandSelect               			0x1
#define bHTSIG2_GI                			0x80
#define bHTSIG2_Smoothing         		0x01
#define bHTSIG2_Sounding          		0x02
#define bHTSIG2_Aggreaton         		0x08
#define bHTSIG2_STBC              		0x30
#define bHTSIG2_AdvCoding         		0x40
#define bHTSIG2_NumOfHTLTF        	0x300
#define bHTSIG2_CRC8              		0x3fc
#define bHTSIG1_MCS               		0x7f
#define bHTSIG1_BandWidth         		0x80
#define bHTSIG1_HTLength          		0xffff
#define bLSIG_Rate                			0xf
#define bLSIG_Reserved            		0x10
#define bLSIG_Length              		0x1fffe
#define bLSIG_Parity              			0x20
#define bCCKRxPhase               		0x4
#define bLSSIReadAddress          		0x3f000000   //LSSI "Read" Address
#define bLSSIReadEdge             		0x80000000   //LSSI "Read" edge signal
#define bLSSIReadBackData         		0xfff
#define bLSSIReadOKFlag           		0x1000
#define bCCKSampleRate            		0x8       //0: 44MHz, 1:88MHz

#define bRegulator0Standby        		0x1
#define bRegulatorPLLStandby      		0x2
#define bRegulator1Standby        		0x4
#define bPLLPowerUp               		0x8
#define bDPLLPowerUp              		0x10
#define bDA10PowerUp              		0x20
#define bAD7PowerUp               		0x200
#define bDA6PowerUp               		0x2000
#define bXtalPowerUp              		0x4000
#define b40MDClkPowerUP           		0x8000
#define bDA6DebugMode             		0x20000
#define bDA6Swing                 			0x380000
#define bADClkPhase               		0x4000000
#define b80MClkDelay              		0x18000000
#define bAFEWatchDogEnable        		0x20000000
#define bXtalCap                			0x0f000000
#define bIntDifClkEnable          		0x400
#define bExtSigClkEnable         	 	0x800
#define bBandgapMbiasPowerUp      	0x10000
#define bAD11SHGain               		0xc0000
#define bAD11InputRange           		0x700000
#define bAD11OPCurrent            		0x3800000
#define bIPathLoopback            		0x4000000
#define bQPathLoopback            		0x8000000
#define bAFELoopback              		0x10000000
#define bDA10Swing                		0x7e0
#define bDA10Reverse              		0x800
#define bDAClkSource              		0x1000
#define bAD7InputRange            		0x6000
#define bAD7Gain                  			0x38000
#define bAD7OutputCMMode          		0x40000
#define bAD7InputCMMode           		0x380000
#define bAD7Current               			0xc00000
#define bRegulatorAdjust          		0x7000000
#define bAD11PowerUpAtTx          		0x1
#define bDA10PSAtTx               		0x10
#define bAD11PowerUpAtRx          		0x100
#define bDA10PSAtRx               		0x1000

#define bCCKRxAGCFormat           		0x200

#define bPSDFFTSamplepPoint       		0xc000
#define bPSDAverageNum            		0x3000
#define bIQPathControl            		0xc00
#define bPSDFreq                  			0x3ff
#define bPSDAntennaPath           		0x30
#define bPSDIQSwitch              		0x40
#define bPSDRxTrigger             		0x400000
#define bPSDTxTrigger             		0x80000000
#define bPSDSineToneScale        		0x7f000000
#define bPSDReport                			0xffff



//for PutRegsetting & GetRegSetting BitMask
#define bMaskByte0                0xff
#define bMaskByte1                0xff00
#define bMaskByte2                0xff0000
#define bMaskByte3                0xff000000
#define bMaskHWord                0xffff0000
#define bMaskLWord                0x0000ffff
#define bMaskDWord                0xffffffff


//page a
#define rCCK0_System              		0xa00
#define rCCK0_AFESetting          		0xa04
#define rCCK0_CCA                 			0xa08
#define rCCK0_RxAGC1              		0xa0c  //AGC default value, saturation level
#define rCCK0_RxAGC2              		0xa10  //AGC & DAGC
#define rCCK0_RxHP                		0xa14
#define rCCK0_DSPParameter1       	0xa18  //Timing recovery & Channel estimation threshold
#define rCCK0_DSPParameter2       	0xa1c  //SQ threshold
#define rCCK0_TxFilter1           		0xa20
#define rCCK0_TxFilter2           		0xa24
#define rCCK0_DebugPort           		0xa28  //debug port and Tx filter3
#define rCCK0_FalseAlarmReport    	0xa2c  //0xa2d
#define rCCK0_TRSSIReport         		0xa50
#define rCCK0_RxReport            		0xa54  //0xa57
#define rCCK0_FACounterLower      	0xa5c  //0xa5b
#define rCCK0_FACounterUpper      	0xa58  //0xa5c



//page-a
#define bCCKBBMode                		0x3
#define bCCKTxPowerSaving         		0x80
#define bCCKRxPowerSaving         		0x40
#define bCCKSideBand              		0x10
#define bCCKScramble              		0x8
#define bCCKAntDiversity    		      	0x8000
#define bCCKCarrierRecovery   	    	0x4000
#define bCCKTxRate           		     	0x3000
#define bCCKDCCancel             	 	0x0800
#define bCCKISICancel             		0x0400
#define bCCKMatchFilter           		0x0200
#define bCCKEqualizer             		0x0100
#define bCCKPreambleDetect       	 	0x800000
#define bCCKFastFalseCCA          		0x400000
#define bCCKChEstStart            		0x300000
#define bCCKCCACount              		0x080000
#define bCCKcs_lim                			0x070000
#define bCCKBistMode              		0x80000000
#define bCCKCCAMask             	  	0x40000000
#define bCCKTxDACPhase         	   	0x4
#define bCCKRxADCPhase         	   	0x20000000   //r_rx_clk
#define bCCKr_cp_mode0         	   	0x0100
#define bCCKTxDCOffset           	 	0xf0
#define bCCKRxDCOffset           	 	0xf
#define bCCKCCAMode              	 	0xc000
#define bCCKFalseCS_lim           		0x3f00
#define bCCKCS_ratio              		0xc00000
#define bCCKCorgBit_sel           		0x300000
#define bCCKPD_lim                			0x0f0000
#define bCCKNewCCA                		0x80000000
#define bCCKRxHPofIG              		0x8000
#define bCCKRxIG                  			0x7f00
#define bCCKLNAPolarity           		0x800000
#define bCCKRx1stGain             		0x7f0000
#define bCCKRFExtend              		0x20000000 //CCK Rx Iinital gain polarity
#define bCCKRxAGCSatLevel        	 	0x1f000000
#define bCCKRxAGCSatCount       	  	0xe0
#define bCCKRxRFSettle            		0x1f       //AGCsamp_dly
#define bCCKFixedRxAGC           	 	0x8000
//#define bCCKRxAGCFormat         	 	0x4000   //remove to HSSI register 0x824
#define bCCKAntennaPolarity      	 	0x2000
#define bCCKTxFilterType          		0x0c00
#define bCCKRxAGCReportType   	   	0x0300
#define bCCKRxDAGCEn              		0x80000000
#define bCCKRxDAGCPeriod        	  	0x20000000
#define bCCKRxDAGCSatLevel     	   	0x1f000000
#define bCCKTimingRecovery       	 	0x800000
#define bCCKTxC0                  			0x3f0000
#define bCCKTxC1                  			0x3f000000
#define bCCKTxC2                  			0x3f
#define bCCKTxC3                  			0x3f00
#define bCCKTxC4                  			0x3f0000
#define bCCKTxC5                  			0x3f000000
#define bCCKTxC6                  			0x3f
#define bCCKTxC7                  			0x3f00
#define bCCKDebugPort             		0xff0000
#define bCCKDACDebug              		0x0f000000
#define bCCKFalseAlarmEnable      		0x8000
#define bCCKFalseAlarmRead        		0x4000
#define bCCKTRSSI                 			0x7f
#define bCCKRxAGCReport           		0xfe
#define bCCKRxReport_AntSel       		0x80000000
#define bCCKRxReport_MFOff        		0x40000000
#define bCCKRxRxReport_SQLoss     	0x20000000
#define bCCKRxReport_Pktloss      		0x10000000
#define bCCKRxReport_Lockedbit    	0x08000000
#define bCCKRxReport_RateError    	0x04000000
#define bCCKRxReport_RxRate       		0x03000000
#define bCCKRxFACounterLower      	0xff
#define bCCKRxFACounterUpper      	0xff000000
#define bCCKRxHPAGCStart          		0xe000
#define bCCKRxHPAGCFinal          		0x1c00

#define bCCKRxFalseAlarmEnable    	0x8000
#define bCCKFACounterFreeze       		0x4000

#define bCCKTxPathSel             		0x10000000
#define bCCKDefaultRxPath         		0xc000000
#define bCCKOptionRxPath          		0x3000000


