xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/include/rtl8192u_regdef.h
//page d
#define rOFDM1_LSTF               		0xd00
#define rOFDM1_TRxPathEnable      	0xd04
#define rOFDM1_CFO                		0xd08
#define rOFDM1_CSI1               		0xd10
#define rOFDM1_SBD                		0xd14
#define rOFDM1_CSI2               		0xd18
#define rOFDM1_CFOTracking        		0xd2c
#define rOFDM1_TRxMesaure1        	0xd34
#define rOFDM1_IntfDet            		0xd3c
#define rOFDM1_PseudoNoiseStateAB 0xd50
#define rOFDM1_PseudoNoiseStateCD 0xd54
#define rOFDM1_RxPseudoNoiseWgt   0xd58
#define rOFDM_PHYCounter1         		0xda0  //cca, parity fail
#define rOFDM_PHYCounter2         		0xda4  //rate illegal, crc8 fail
#define rOFDM_PHYCounter3         		0xda8  //MCS not support
#define rOFDM_ShortCFOAB          		0xdac
#define rOFDM_ShortCFOCD          		0xdb0
#define rOFDM_LongCFOAB           		0xdb4
#define rOFDM_LongCFOCD           		0xdb8
#define rOFDM_TailCFOAB           		0xdbc
#define rOFDM_TailCFOCD           		0xdc0
#define rOFDM_PWMeasure1          	0xdc4
#define rOFDM_PWMeasure2          	0xdc8
#define rOFDM_BWReport            		0xdcc
#define rOFDM_AGCReport           		0xdd0
#define rOFDM_RxSNR               		0xdd4
#define rOFDM_RxEVMCSI            		0xdd8
#define rOFDM_SIGReport           		0xddc



//----------------------------------------------------------------------------
//       8190 Rate Adaptive Table Register	(offset 0x320, 4 byte)
//----------------------------------------------------------------------------
//	CCK
#define	RATR_1M		0x00000001
#define	RATR_2M		0x00000002
#define	RATR_55M	0x00000004
#define	RATR_11M	0x00000008
//	OFDM
#define	RATR_6M		0x00000010
#define	RATR_9M		0x00000020
#define	RATR_12M	0x00000040
#define	RATR_18M	0x00000080
#define	RATR_24M	0x00000100
#define	RATR_36M	0x00000200
#define	RATR_48M	0x00000400
#define	RATR_54M	0x00000800
//	MCS 1 Spatial Stream	
#define	RATR_MCS0	0x00001000
#define	RATR_MCS1	0x00002000
#define	RATR_MCS2	0x00004000
#define	RATR_MCS3	0x00008000
#define	RATR_MCS4	0x00010000
#define	RATR_MCS5	0x00020000
#define	RATR_MCS6	0x00040000
#define	RATR_MCS7	0x00080000
//	MCS 2 Spatial Stream
#define	RATR_MCS8	0x00100000
#define	RATR_MCS9	0x00200000
#define	RATR_MCS10	0x00400000
#define	RATR_MCS11	0x00800000
#define	RATR_MCS12	0x01000000
#define	RATR_MCS13	0x02000000
#define	RATR_MCS14	0x04000000
#define	RATR_MCS15	0x08000000
//	ALL CCK Rate
#define RATE_ALL_CCK				RATR_1M|RATR_2M|RATR_55M|RATR_11M 
#define RATE_ALL_OFDM_AG			RATR_6M|RATR_9M|RATR_12M|RATR_18M|RATR_24M\
									|RATR_36M|RATR_48M|RATR_54M	
#define RATE_ALL_OFDM_1SS			RATR_MCS0|RATR_MCS1|RATR_MCS2|RATR_MCS3 | \
									RATR_MCS4|RATR_MCS5|RATR_MCS6	|RATR_MCS7	
#define RATE_ALL_OFDM_2SS			RATR_MCS8|RATR_MCS9	|RATR_MCS10|RATR_MCS11| \
									RATR_MCS12|RATR_MCS13|RATR_MCS14|RATR_MCS15
									
#endif
